HomiKetalys/gd32ai-modelzoo/object_detection/yolo_fastestv2/deployment/GD32H759I_EVAL_GCC/App/TLILCD/TLILCD.c
    gpio_mode_set(GPIOD, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_3);
    gpio_output_options_set(GPIOD, GPIO_OTYPE_PP, GPIO_OSPEED_60MHZ, GPIO_PIN_3);
    gpio_mode_set(GPIOC, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_7);
    gpio_output_options_set(GPIOC, GPIO_OTYPE_PP, GPIO_OSPEED_60MHZ, GPIO_PIN_7);
    gpio_mode_set(GPIOC, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_1);
    gpio_output_options_set(GPIOC, GPIO_OTYPE_PP, GPIO_OSPEED_60MHZ, GPIO_PIN_1);
    gpio_mode_set(GPIOH, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_15);
    gpio_output_options_set(GPIOH, GPIO_OTYPE_PP, GPIO_OSPEED_60MHZ, GPIO_PIN_15);
    gpio_mode_set(GPIOH, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_14);
    gpio_output_options_set(GPIOH, GPIO_OTYPE_PP, GPIO_OSPEED_60MHZ, GPIO_PIN_14);
    gpio_mode_set(GPIOH, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_13);
    gpio_output_options_set(GPIOH, GPIO_OTYPE_PP, GPIO_OSPEED_60MHZ, GPIO_PIN_13);
    gpio_mode_set(GPIOB, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_0);
    gpio_output_options_set(GPIOB, GPIO_OTYPE_PP, GPIO_OSPEED_60MHZ, GPIO_PIN_0);
    gpio_mode_set(GPIOB, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_1);
    gpio_output_options_set(GPIOB, GPIO_OTYPE_PP, GPIO_OSPEED_60MHZ, GPIO_PIN_1);

    /* configure LCD_B7(PB9), LCD_B6(PB8), LCD_B5(PB5), LCD_B4(PC11), LCD_B3(PG11),LCD_B2(PG10), LCD_B1(PG12), LCD_B0(PG14) */
    gpio_af_set(GPIOB, GPIO_AF_14, GPIO_PIN_9);
    gpio_af_set(GPIOB, GPIO_AF_14, GPIO_PIN_8);
    gpio_af_set(GPIOB, GPIO_AF_3, GPIO_PIN_5);
    gpio_af_set(GPIOC, GPIO_AF_14, GPIO_PIN_11);
    gpio_af_set(GPIOG, GPIO_AF_14, GPIO_PIN_11);
    gpio_af_set(GPIOG, GPIO_AF_14, GPIO_PIN_10);
    gpio_af_set(GPIOG, GPIO_AF_14, GPIO_PIN_12);
    gpio_af_set(GPIOG, GPIO_AF_14, GPIO_PIN_14);

    gpio_mode_set(GPIOB, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_9);
    gpio_output_options_set(GPIOB, GPIO_OTYPE_PP, GPIO_OSPEED_60MHZ, GPIO_PIN_9);
    gpio_mode_set(GPIOB, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_8);
    gpio_output_options_set(GPIOB, GPIO_OTYPE_PP, GPIO_OSPEED_60MHZ, GPIO_PIN_8);
    gpio_mode_set(GPIOB, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_5);
    gpio_output_options_set(GPIOB, GPIO_OTYPE_PP, GPIO_OSPEED_60MHZ, GPIO_PIN_5);
    gpio_mode_set(GPIOC, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_11);
    gpio_output_options_set(GPIOC, GPIO_OTYPE_PP, GPIO_OSPEED_60MHZ, GPIO_PIN_11);
    gpio_mode_set(GPIOG, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_11);
    gpio_output_options_set(GPIOG, GPIO_OTYPE_PP, GPIO_OSPEED_60MHZ, GPIO_PIN_11);
    gpio_mode_set(GPIOG, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_10);
    gpio_output_options_set(GPIOG, GPIO_OTYPE_PP, GPIO_OSPEED_60MHZ, GPIO_PIN_10);
    gpio_mode_set(GPIOG, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_12);
    gpio_output_options_set(GPIOG, GPIO_OTYPE_PP, GPIO_OSPEED_60MHZ, GPIO_PIN_12);
    gpio_mode_set(GPIOG, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_14);
    gpio_output_options_set(GPIOG, GPIO_OTYPE_PP, GPIO_OSPEED_60MHZ, GPIO_PIN_14);

    /* configure LCD_DE(PF10) */
    gpio_af_set(GPIOF, GPIO_AF_14, GPIO_PIN_10);
    gpio_mode_set(GPIOF, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_10);
    gpio_output_options_set(GPIOF, GPIO_OTYPE_PP, GPIO_OSPEED_60MHZ, GPIO_PIN_10);
    /* LCD PWM BackLight(PG13) */
    gpio_mode_set(GPIOG, GPIO_MODE_OUTPUT, GPIO_PUPD_PULLUP, GPIO_PIN_13);
    gpio_output_options_set(GPIOG, GPIO_OTYPE_PP, GPIO_OSPEED_60MHZ, GPIO_PIN_13);
    gpio_bit_set(GPIOG, GPIO_PIN_13);
}

/*********************************************************************************************************
* 函数名称：InitLCD
* 函数功能：初始化LCD模块
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
void InitLCD(void)
{
  u32 i;

  //TLI初始化结构体
  tli_parameter_struct tli_init_struct;

  //初始化LCD设备结构体（默认横屏，当前层为背景层）
  g_structTLILCDDev.pWidth = LCD_PIXEL_WIDTH;
  g_structTLILCDDev.pHeight = LCD_PIXEL_HEIGHT;
  g_structTLILCDDev.dir = LCD_SCREEN_HORIZONTAL;
  g_structTLILCDDev.currentLayer = LCD_LAYER_BACKGROUND;
  g_structTLILCDDev.frameBuf = s_arrBackgroundFrame;
  g_structTLILCDDev.backFrameAddr = BACK_FRAME_START_ADDR;
  g_structTLILCDDev.foreFrameAddr = FORE_FRAME_START_ADDR;
  g_structTLILCDDev.pixelSize = 2;
  for(i = 0; i < LCD_LAYER_MAX; i++)
  {
    g_structTLILCDDev.width[i] = g_structTLILCDDev.pWidth;
    g_structTLILCDDev.height[i] = g_structTLILCDDev.pHeight;
  }

  //使能RCU时钟
	rcu_periph_clock_enable(RCU_TLI);
  tli_gpio_config();

  //复位TLI
  tli_deinit();
  tli_struct_para_init(&tli_init_struct);

  //配置TLI时钟（时钟频率为1MHz * 200 / 5 / 4 = 10MHz，数据手册给的典型值是30MHz，但是10MHz刷新率下更稳定）
//  if(ERROR == rcu_pllsai_config(240, 4, 4)){while(1);}
//  rcu_tli_clock_div_config(RCU_PLLSAIR_DIV2);
//  // if(ERROR == rcu_pllsai_config(200, 4, 5)){while(1);}
//  // rcu_tli_clock_div_config(RCU_PLLSAIR_DIV4);
//  // if(ERROR == rcu_pllsai_config(50, 4, 5)){while(1);}
//  // rcu_tli_clock_div_config(RCU_PLLSAIR_DIV4);
//  rcu_osci_on(RCU_PLLSAI_CK);
//  if(ERROR == rcu_osci_stab_wait(RCU_PLLSAI_CK)){while(1);}
	rcu_pll_input_output_clock_range_config(IDX_PLL2, RCU_PLL2RNG_1M_2M, RCU_PLL2VCO_150M_420M);
	if(ERROR == rcu_pll2_config(25, 188, 3, 3, 3)) {
			while(1) {
			}
	}
	rcu_pll_clock_output_enable(RCU_PLL2R);
	rcu_tli_clock_div_config(RCU_PLL2R_DIV8);
	rcu_osci_on(RCU_PLL2_CK);

	if(ERROR == rcu_osci_stab_wait(RCU_PLL2_CK)) {
			while(1) {
			}
	}

  //TLI初始化
  //信号极性配置
  tli_init_struct.signalpolarity_hs      = TLI_HSYN_ACTLIVE_LOW; //水平同步脉冲低电平有效
  tli_init_struct.signalpolarity_vs      = TLI_VSYN_ACTLIVE_LOW; //垂直同步脉冲低电平有效
  tli_init_struct.signalpolarity_de      = TLI_DE_ACTLIVE_LOW;   //数据使能低电平有效
  tli_init_struct.signalpolarity_pixelck = TLI_PIXEL_CLOCK_TLI;  //像素时钟是TLI时钟

  //显示时序配置
  tli_init_struct.synpsz_hpsz   = HORIZONTAL_SYNCHRONOUS_PULSE - 1; //水平同步脉冲宽度
  tli_init_struct.synpsz_vpsz   = VERTICAL_SYNCHRONOUS_PULSE - 1;   //垂直同步脉冲宽度
  tli_init_struct.backpsz_hbpsz = HORIZONTAL_SYNCHRONOUS_PULSE + HORIZONTAL_BACK_PORCH - 1; //水平后沿加同步脉冲的宽度
  tli_init_struct.backpsz_vbpsz = VERTICAL_SYNCHRONOUS_PULSE + VERTICAL_BACK_PORCH - 1;     //垂直后沿加同步脉冲的宽度
  tli_init_struct.activesz_hasz = HORIZONTAL_SYNCHRONOUS_PULSE + HORIZONTAL_BACK_PORCH + ACTIVE_WIDTH - 1; //水平有效宽度加后沿像素和水平同步像素宽度
  tli_init_struct.activesz_vasz = VERTICAL_SYNCHRONOUS_PULSE + VERTICAL_BACK_PORCH + ACTIVE_HEIGHT - 1;    //垂直有效宽度加后沿像素和垂直同步像素宽度
  tli_init_struct.totalsz_htsz  = HORIZONTAL_SYNCHRONOUS_PULSE + HORIZONTAL_BACK_PORCH + ACTIVE_WIDTH + HORIZONTAL_FRONT_PORCH - 1; //显示器的水平总宽度
  tli_init_struct.totalsz_vtsz  = VERTICAL_SYNCHRONOUS_PULSE + VERTICAL_BACK_PORCH + ACTIVE_HEIGHT + VERTICAL_FRONT_PORCH - 1;      //显示器的垂直总宽度
//	/* timing configuration */
//	/* configure horizontal synchronization width */
//	tli_init_struct.synpsz_hpsz = 40;
//	/* configure vertical synchronization height */
//	tli_init_struct.synpsz_vpsz = 9;
//	/* configure accumulated horizontal back porch */
//	tli_init_struct.backpsz_hbpsz = 42;
//	/* configure accumulated vertical back porch */
//	tli_init_struct.backpsz_vbpsz = 11;
//	/* configure accumulated active width */
//	tli_init_struct.activesz_hasz = 522;
//	/* configure accumulated active height */
//	tli_init_struct.activesz_vasz = 283;
//	/* configure total width */
//	tli_init_struct.totalsz_htsz = 524;
//	/* configure total height */
//	tli_init_struct.totalsz_vtsz = 285;
  
  //配置BG层颜色（黑色）
  tli_init_struct.backcolor_red = 0x00;
  tli_init_struct.backcolor_green = 0x00;
  tli_init_struct.backcolor_blue = 0x00;

  //根据参数配置TLI
  tli_init(&tli_init_struct);

