HomiKetalys/gd32ai-modelzoo/object_detection/yolo_fastestv2/deployment/GD32H759I_EVAL_GCC/App/TLILCD/TLILCD.c
  //初始化背景层和前景层
  LCDLayerWindowSet(LCD_LAYER_BACKGROUND, 0, 0, LCD_PIXEL_WIDTH, LCD_PIXEL_HEIGHT);
  LCDLayerWindowSet(LCD_LAYER_FOREGROUND, 0, 0, LCD_PIXEL_WIDTH, LCD_PIXEL_HEIGHT);

  //使能背景层
  LCDLayerEnable(LCD_LAYER_BACKGROUND);

  //禁用前景层
  LCDLayerDisable(LCD_LAYER_FOREGROUND);

  //设置背景层透明度
  LCDTransparencySet(LCD_LAYER_BACKGROUND, 0xFF);

  //设置前景层透明度
  LCDTransparencySet(LCD_LAYER_FOREGROUND, 0xFF);

  //开启抖动
  tli_dither_config(TLI_DITHER_ENABLE);

  // //关闭抖动
  // tli_dither_config(TLI_DITHER_DISABLE);

  //立即更新TLI寄存器
  tli_reload_config(TLI_REQUEST_RELOAD_EN);

  //TLI外设使能
  tli_enable();

  //切换到背景层
  LCDLayerSwitch(LCD_LAYER_BACKGROUND);

  //横屏显示
  LCDDisplayDir(LCD_SCREEN_HORIZONTAL);

  //清屏
  LCDClear(LCD_COLOR_BLACK);
}

/*********************************************************************************************************
* 函数名称：LCDLayerWindowSet
* 函数功能：设置层窗口
* 输入参数：layer：前景或背景层定义（LCD_LAYER_FOREGROUND、LCD_LAYER_BACKGROUND）
*          x,y：窗口位置
*          width：窗口宽度
*          height：窗口高度
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：
*          1、当该层被禁止或TLI_LxHPOS和TLI_LxVPOS定义的窗口之外，默认颜色值生效
*          2、LCD屏幕方向默认是横屏
*********************************************************************************************************/
void LCDLayerWindowSet(EnumTLILCDLayer layer, u32 x, u32 y, u32 width, u32 height)
{
  //TLI初始化结构体
  tli_layer_parameter_struct  tli_layer_init_struct; 
  
  //临时变量
  u32 swap, x0, y0;
  
  //配置默认值
  tli_layer_struct_para_init(&tli_layer_init_struct);

  //竖屏特殊处理
  if(LCD_SCREEN_VERTICAL == g_structTLILCDDev.dir)
  {
    //坐标系变换
    x0 = x;
    y0 = y + height - 1;
    y = x0;
    x = LCD_PIXEL_WIDTH - 1 - y0;
    if(x >= LCD_PIXEL_WIDTH){return;}
    if(y >= LCD_PIXEL_HEIGHT){return;}

    //交换宽度和高度
    swap = width;
    width = height;
    height = swap;
  }

  //矫正宽度
  if((x + width) > LCD_PIXEL_WIDTH)
  {
    width = LCD_PIXEL_WIDTH - x;
  }

  //矫正高度
  if((y + height) > LCD_PIXEL_HEIGHT)
  {
    height = LCD_PIXEL_HEIGHT - y;
  }

  //背景配置
  if(LCD_LAYER_BACKGROUND == layer)
  {
    tli_layer_init_struct.layer_window_leftpos    = (x + HORIZONTAL_SYNCHRONOUS_PULSE + HORIZONTAL_BACK_PORCH);             //窗口左侧位置
    tli_layer_init_struct.layer_window_rightpos   = (x + width + HORIZONTAL_SYNCHRONOUS_PULSE + HORIZONTAL_BACK_PORCH-1); //窗口右侧位置
    tli_layer_init_struct.layer_window_toppos     = (y + VERTICAL_SYNCHRONOUS_PULSE + VERTICAL_BACK_PORCH);                 //窗口顶部位置
    tli_layer_init_struct.layer_window_bottompos  = (y + height + VERTICAL_SYNCHRONOUS_PULSE + VERTICAL_BACK_PORCH - 1);    //窗口底部位置
//    tli_layer_init_struct.layer_window_leftpos    = 45;             //窗口左侧位置
//    tli_layer_init_struct.layer_window_rightpos   = (43 + 480 - 1); //窗口右侧位置
//    tli_layer_init_struct.layer_window_toppos     = 12;                 //窗口顶部位置
//    tli_layer_init_struct.layer_window_bottompos  = (12 + 272 - 1);    //窗口底部位置
    tli_layer_init_struct.layer_ppf               = LAYER_PPF_RGB565;          //像素格式
    tli_layer_init_struct.layer_sa                = 0xFF;                      //恒定Aplha值
    tli_layer_init_struct.layer_default_blue      = 0xFF;                      //默认颜色B值
    tli_layer_init_struct.layer_default_green     = 0xFF;                      //默认颜色G值
    tli_layer_init_struct.layer_default_red       = 0xFF;                      //默认颜色R值
    tli_layer_init_struct.layer_default_alpha     = 0xFF;                      //默认颜色Aplha值，默认显示
    tli_layer_init_struct.layer_acf1              = LAYER_ACF1_PASA;           //归一化的像素Alpha乘以归一化的恒定Alpha
    tli_layer_init_struct.layer_acf2              = LAYER_ACF2_PASA;           //归一化的像素Alpha乘以归一化的恒定Alpha
    tli_layer_init_struct.layer_frame_bufaddr     = (u32)s_arrBackgroundFrame; //缓冲区首地址
    tli_layer_init_struct.layer_frame_line_length = ((width * 2) + 3);         //行长度
    tli_layer_init_struct.layer_frame_buf_stride_offset = (width * 2);         //步幅偏移，某行起始处到下一行起始处之间的字节数
    tli_layer_init_struct.layer_frame_total_line_number = height;              //帧行数
    tli_layer_init(LAYER0, &tli_layer_init_struct); //根据参数初始化背景层
    tli_color_key_disable(LAYER0);                  //禁用色键
    tli_lut_disable(LAYER0);                        //禁用颜色查找表

    //保存窗口宽度和高度
    if(LCD_SCREEN_HORIZONTAL == g_structTLILCDDev.dir)
    {
      g_structTLILCDDev.width[LCD_LAYER_BACKGROUND] = width;
      g_structTLILCDDev.height[LCD_LAYER_BACKGROUND] = height;
    }
    else if(LCD_SCREEN_VERTICAL == g_structTLILCDDev.dir)
    {
      g_structTLILCDDev.width[LCD_LAYER_BACKGROUND] = height;
      g_structTLILCDDev.height[LCD_LAYER_BACKGROUND] = width;
    }
  }
  
  //前景配置
  else if(LCD_LAYER_FOREGROUND == layer)
  {
    tli_layer_init_struct.layer_window_leftpos    = (x + HORIZONTAL_SYNCHRONOUS_PULSE + HORIZONTAL_BACK_PORCH);             //窗口左侧位置
    tli_layer_init_struct.layer_window_rightpos   = (x + width + HORIZONTAL_SYNCHRONOUS_PULSE + HORIZONTAL_BACK_PORCH - 1); //窗口右侧位置
    tli_layer_init_struct.layer_window_toppos     = (y + VERTICAL_SYNCHRONOUS_PULSE + VERTICAL_BACK_PORCH);                 //窗口顶部位置
    tli_layer_init_struct.layer_window_bottompos  = (y + height + VERTICAL_SYNCHRONOUS_PULSE + VERTICAL_BACK_PORCH - 1);    //窗口底部位置
    tli_layer_init_struct.layer_ppf               = LAYER_PPF_RGB565;          //像素格式
    tli_layer_init_struct.layer_sa                = 0xFF;                      //恒定Aplha值
    tli_layer_init_struct.layer_default_blue      = 0xFF;                      //默认颜色B值
    tli_layer_init_struct.layer_default_green     = 0xFF;                      //默认颜色G值
    tli_layer_init_struct.layer_default_red       = 0xFF;                      //默认颜色R值
    tli_layer_init_struct.layer_default_alpha     = 0x00;                      //默认颜色Aplha值，默认不显示
    tli_layer_init_struct.layer_acf1              = LAYER_ACF1_PASA;           //归一化的像素Alpha乘以归一化的恒定Alpha
    tli_layer_init_struct.layer_acf2              = LAYER_ACF2_PASA;           //归一化的像素Alpha乘以归一化的恒定Alpha
    tli_layer_init_struct.layer_frame_bufaddr     = (u32)s_arrForegroundFrame; //缓冲区首地址
    tli_layer_init_struct.layer_frame_line_length = ((width * 2) + 3);         //行长度
    tli_layer_init_struct.layer_frame_buf_stride_offset = (width * 2);         //步幅偏移，某行起始处到下一行起始处之间的字节数
    tli_layer_init_struct.layer_frame_total_line_number = height;              //帧行数
    tli_layer_init(LAYER1, &tli_layer_init_struct); //根据参数初始化前景层
    tli_color_key_disable(LAYER1);                  //禁用色键
    tli_lut_disable(LAYER1);                        //禁用颜色查找表

    //保存窗口宽度和高度
    if(LCD_SCREEN_HORIZONTAL == g_structTLILCDDev.dir)
    {
      g_structTLILCDDev.width[LCD_LAYER_FOREGROUND] = width;
      g_structTLILCDDev.height[LCD_LAYER_FOREGROUND] = height;
    }
    else if(LCD_SCREEN_VERTICAL == g_structTLILCDDev.dir)
    {
      g_structTLILCDDev.width[LCD_LAYER_FOREGROUND] = height;
      g_structTLILCDDev.height[LCD_LAYER_FOREGROUND] = width;
    }
  }

  //立即更新TLI寄存器
  tli_reload_config(TLI_REQUEST_RELOAD_EN);
}

