HomiKetalys/gd32ai-modelzoo/object_detection/yolo_fastestv2/deployment/GD32H759I_EVAL_GCC/App/TLILCD/TLILCD.c
/*********************************************************************************************************
* 函数名称：LCDLayerEnable
* 函数功能：使能背景或前景层
* 输入参数：layer：前景或背景层定义（LCD_LAYER_FOREGROUND、LCD_LAYER_BACKGROUND）
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
void LCDLayerEnable(EnumTLILCDLayer layer)
{
  //使能背景层
  if(LCD_LAYER_BACKGROUND == layer)
  {
    tli_layer_enable(LAYER0);
  }
  
  //使能前景层
  else if(LCD_LAYER_FOREGROUND == layer)
  {
    tli_layer_enable(LAYER1);
  }

  //立即更新TLI寄存器
  tli_reload_config(TLI_REQUEST_RELOAD_EN);
}

/*********************************************************************************************************
* 函数名称：LCDLayerDisable
* 函数功能：禁用背景或前景层
* 输入参数：layer：前景或背景层定义（LCD_LAYER_FOREGROUND、LCD_LAYER_BACKGROUND）
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
void LCDLayerDisable(EnumTLILCDLayer layer)
{
  //使能背景层
  if(LCD_LAYER_BACKGROUND == layer)
  {
    tli_layer_disable(LAYER0);
  }
  
  //使能前景层
  else if(LCD_LAYER_FOREGROUND == layer)
  {
    tli_layer_disable(LAYER1);
  }

  //立即更新TLI寄存器
  tli_reload_config(TLI_REQUEST_RELOAD_EN);
}

/*********************************************************************************************************
* 函数名称：LCDLayerSwitch
* 函数功能：切换层
* 输入参数：layer：前景或背景层定义（LCD_LAYER_FOREGROUND、LCD_LAYER_BACKGROUND）
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
void LCDLayerSwitch(EnumTLILCDLayer layer)
{
  //切换到背景层
  if(LCD_LAYER_BACKGROUND == layer)
  {
    g_structTLILCDDev.frameBuf = s_arrBackgroundFrame;
    g_structTLILCDDev.currentLayer = LCD_LAYER_BACKGROUND;
  }
  
  //切换到前景层
  else
  {
    g_structTLILCDDev.frameBuf = s_arrForegroundFrame;
    g_structTLILCDDev.currentLayer = LCD_LAYER_FOREGROUND;
  }
}

/*********************************************************************************************************
* 函数名称：LCDTransparencySet
* 函数功能：设置当前层的透明度
* 输入参数：trans：透明度配置
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
void LCDTransparencySet(EnumTLILCDLayer layer, u8 trans)
{
  //设置背景透明度
  if (LCD_LAYER_BACKGROUND == layer)
  {
    TLI_LXSA(LAYER0) &= ~(TLI_LXSA_SA);
    TLI_LXSA(LAYER0) = trans;
  }

  //设置前景透明度
  else
  {
    TLI_LXSA(LAYER1) &= ~(TLI_LXSA_SA);
    TLI_LXSA(LAYER1) = trans;
  }

  //立即更新TLI寄存器
  tli_reload_config(TLI_REQUEST_RELOAD_EN);
}

/*********************************************************************************************************
* 函数名称：LCDDisplayOn
* 函数功能：开启LCD显示
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
void LCDDisplayOn(void)
{
  tli_enable();
}

/*********************************************************************************************************
* 函数名称：LCDDisplayOff
* 函数功能：关闭LCD显示
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：因为RGB屏不自带显存，所以关闭TLI后图案显示会逐渐消失，直至花屏
*********************************************************************************************************/
void LCDDisplayOff(void)
{
  tli_disable();
}

/*********************************************************************************************************
* 函数名称：LCDWaitHIdle
* 函数功能：等待LCD行传输空闲
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
void LCDWaitHIdle(void)
{
  while(RESET == tli_flag_get(TLI_FLAG_HDE));
  while(SET == tli_flag_get(TLI_FLAG_HDE));
}

/*********************************************************************************************************
* 函数名称：LCDWaitVIdle
* 函数功能：等待LCD场传输空闲
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
void LCDWaitVIdle(void)
{
  while(RESET == tli_flag_get(TLI_FLAG_VDE));
  while(SET == tli_flag_get(TLI_FLAG_VDE));
}

/*********************************************************************************************************
* 函数名称: LCDDisplayDir
* 函数功能: 设置LCD显示方向
* 输入参数: dir：显示方向（LCD_SCREEN_HORIZONTAL，LCD_SCREEN_VERTICAL）
* 输出参数: void
* 返 回 值: void
* 创建日期: 2018年01月01日
* 注    意: 
*********************************************************************************************************/
void LCDDisplayDir(EnumTLILCDDir dir)
{
  u32 swap;

  //交换宽度和高度
  if(g_structTLILCDDev.dir != dir)
  {
    //保存显示方向
    g_structTLILCDDev.dir = dir;

    //交换背景层宽度和高度
    swap = g_structTLILCDDev.width[LCD_LAYER_BACKGROUND];
    g_structTLILCDDev.width[LCD_LAYER_BACKGROUND] = g_structTLILCDDev.height[LCD_LAYER_BACKGROUND];
    g_structTLILCDDev.height[LCD_LAYER_BACKGROUND] = swap;

    //交换前景层宽度和高度
    swap = g_structTLILCDDev.width[LCD_LAYER_FOREGROUND];
    g_structTLILCDDev.width[LCD_LAYER_FOREGROUND] = g_structTLILCDDev.height[LCD_LAYER_FOREGROUND];
    g_structTLILCDDev.height[LCD_LAYER_FOREGROUND] = swap;
  }
}

/*********************************************************************************************************
* 函数名称：LCDClear
* 函数功能：清屏
* 输入参数：color：填充颜色
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
void LCDClear(u32 color)
{
  //目标图像参数结构体
  ipa_destination_parameter_struct  ipa_destination_init_struct;

  //RGB
  u8 red, green, blue;

  //RGB565转RGB888
  RGB565ToRGB888A(color, &red, &green, &blue);

  //使能IPA时钟
  rcu_periph_clock_enable(RCU_IPA);

  //复位IPA
  ipa_deinit();

  //设置转换模式
  ipa_pixel_format_convert_mode_set(IPA_FILL_UP_DE); //颜色填充

  //设置目标图像参数
  ipa_destination_struct_para_init(&ipa_destination_init_struct);
  ipa_destination_init_struct.destination_pf       = IPA_DPF_RGB565;                  //目标图像格式
  ipa_destination_init_struct.destination_memaddr  = (u32)g_structTLILCDDev.frameBuf; //目标图像存储地址
  ipa_destination_init_struct.destination_lineoff  = 0;                //行末与下一行开始之间的像素点数
  ipa_destination_init_struct.destination_prealpha = 0xFF;             //目标层预定义透明度
  ipa_destination_init_struct.destination_prered   = red;              //目标层预定义红色值
  ipa_destination_init_struct.destination_pregreen = green;            //目标层预定义绿色值
  ipa_destination_init_struct.destination_preblue  = blue;             //目标层预定义蓝色值
  ipa_destination_init_struct.image_width          = LCD_PIXEL_WIDTH;  //目标图像宽度
  ipa_destination_init_struct.image_height         = LCD_PIXEL_HEIGHT; //目标图像高度
  ipa_destination_init(&ipa_destination_init_struct); //根据参数配置目标图像

  // //使能IPA内部定时器
  // ipa_interval_clock_num_config(0);
  // ipa_inter_timer_config(IPA_INTER_TIMER_ENABLE);

  //开启传输
  ipa_transfer_enable();

  //等待传输结束
  while(RESET == ipa_interrupt_flag_get(IPA_INT_FLAG_FTF));

