HomiKetalys/gd32ai-modelzoo/object_detection/yolo_fastestv2/deployment/GD32H759I_EVAL_GCC/App/TLILCD/TLILCD.c
  //清除标志位
  ipa_interrupt_flag_clear(IPA_INT_FLAG_FTF);

  //关闭IPA
  ipa_deinit();
}

/*********************************************************************************************************
* 函数名称：LCDDrawPoint
* 函数功能：画点
* 输入参数：x, y：坐标，color：颜色
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
void LCDDrawPoint(u32 x, u32 y, u32 color)
{
  u32 width, height;

  //获取当前窗口的宽度和高度
  width = g_structTLILCDDev.width[g_structTLILCDDev.currentLayer];
  height = g_structTLILCDDev.height[g_structTLILCDDev.currentLayer];

  //画点范围超出屏幕坐标
	if(x >= width || y >= height)
	{
		return;
	}

  //横屏
  if(LCD_SCREEN_HORIZONTAL == g_structTLILCDDev.dir) 
  {
    g_structTLILCDDev.frameBuf[width * y + x] = color;
  }

  //竖屏
  else
  {
    g_structTLILCDDev.frameBuf[height * (width-1-x) + y] = color;
  }
}

/*********************************************************************************************************
* 函数名称：LCDReadPoint
* 函数功能：读点
* 输入参数：x, y：坐标
* 输出参数：void
* 返 回 值：颜色值
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
u32 LCDReadPoint(u32 x, u32 y)
{
  u32 width, height;

  //获取当前窗口的宽度和高度
  width = g_structTLILCDDev.width[g_structTLILCDDev.currentLayer];
  height = g_structTLILCDDev.height[g_structTLILCDDev.currentLayer];

  //读点范围超出屏幕坐标，默认返回黑色
  if(x >= width || y >= height)
  {
    return 0;
  }

  //横屏
  if(LCD_SCREEN_HORIZONTAL == g_structTLILCDDev.dir) 
  {
    return g_structTLILCDDev.frameBuf[width * y + x];
  }

  //竖屏
  else
  {
    return g_structTLILCDDev.frameBuf[height * x + (height - 1 - y)];
  }
}

/*********************************************************************************************************
* 函数名称：LCDFill
* 函数功能：LCD填充
* 输入参数：x, y：起始坐标，width：宽度，height：高度，color：填充颜色
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：填充时最后一排会莫名多绘制两点，原因未知
*********************************************************************************************************/
void LCDFill(u32 x, u32 y, u32 width, u32 height, u32 color)
{
  ipa_destination_parameter_struct  ipa_destination_init_struct; //目标图像参数结构体
  u32 destStartAddr;       //目标图像起始地址
  u32 phyWidth, phyHeight; //横屏宽度和高度
  u32 phyX, phyY;          //横屏时填充起始地址
  u32 lineOff;             //目标行偏移，最后一个像素和下一行第一个像素之间的像素数目
  u32 swap;                //交换数据时的临时变量
  u8  red, green, blue;    //RGB
  u32 x1, y1, x2, y2, color1, color2;

  //横屏，记录宽度、高低以及起始地址
  if(LCD_SCREEN_HORIZONTAL == g_structTLILCDDev.dir)
  {
    phyWidth = g_structTLILCDDev.width[g_structTLILCDDev.currentLayer];
    phyHeight = g_structTLILCDDev.height[g_structTLILCDDev.currentLayer];
    phyX = x;
    phyY = y;
  }

  //竖屏，因为是按照横屏方式配置，所以要将宽度、高度转换过来，并做起始坐标转换
  else if(LCD_SCREEN_VERTICAL == g_structTLILCDDev.dir)
  {
    //获取屏幕宽度和高度
    phyWidth = g_structTLILCDDev.width[g_structTLILCDDev.currentLayer];
    phyHeight = g_structTLILCDDev.height[g_structTLILCDDev.currentLayer];

    //交换屏幕宽度和高度
    swap = phyWidth;
    phyWidth = phyHeight;
    phyHeight = swap;

    //交换填充区域宽度和高度
    swap = width;
    width = height;
    height = swap;

    //坐标系转换
    phyX = phyWidth - y - width;
    phyY = x;
  }

  //填充区域修正，防止填充区域超出屏幕范围
  if((phyX + width) > LCD_PIXEL_WIDTH)
  {
    width = LCD_PIXEL_WIDTH - phyX;
  }
  if((phyY + height) > LCD_PIXEL_HEIGHT)
  {
    height = LCD_PIXEL_HEIGHT - phyY;
  }

  //保存坐标点信息
  if(LCD_SCREEN_HORIZONTAL == g_structTLILCDDev.dir)
  {
    x1 = phyX;
    x2 = x1 + 1;
    y1 = phyY + height;
    y2 = y1;
  }
  else if(LCD_SCREEN_VERTICAL == g_structTLILCDDev.dir)
  {
    x1 = x + height;
    x2 = x1;
    y1 = y + width - 1;
    y2 = y1 - 1;
  }
  color1 = LCDReadPoint(x1, y1);
  color2 = LCDReadPoint(x2, y2);

  //计算目标图像起始地址
  destStartAddr = (u32)g_structTLILCDDev.frameBuf + g_structTLILCDDev.pixelSize * (phyWidth * phyY + phyX);

  //计算目标行偏移
  lineOff = phyWidth - width;

  //RGB565转RGB888
  RGB565ToRGB888A(color, &red, &green, &blue);

  //使能IPA时钟
  rcu_periph_clock_enable(RCU_IPA);

  //复位IPA
  ipa_deinit();

  //设置转换模式
  ipa_pixel_format_convert_mode_set(IPA_FILL_UP_DE); //颜色填充

  //设置目标图像参数
  ipa_destination_struct_para_init(&ipa_destination_init_struct);
  ipa_destination_init_struct.destination_pf       = IPA_DPF_RGB565; //目标图像格式
  ipa_destination_init_struct.destination_memaddr  = destStartAddr;  //目标图像存储地址
  ipa_destination_init_struct.destination_lineoff  = lineOff;        //行末与下一行开始之间的像素点数
  ipa_destination_init_struct.destination_prealpha = 0xFF;           //目标层预定义透明度
  ipa_destination_init_struct.destination_prered   = red;            //目标层预定义红色值
  ipa_destination_init_struct.destination_pregreen = green;          //目标层预定义绿色值
  ipa_destination_init_struct.destination_preblue  = blue;           //目标层预定义蓝色值
  ipa_destination_init_struct.image_width          = width;          //目标图像宽度
  ipa_destination_init_struct.image_height         = height;         //目标图像高度
  ipa_destination_init(&ipa_destination_init_struct);                //根据参数配置目标图像

  // //使能IPA内部定时器
  // ipa_interval_clock_num_config(0);
  // ipa_inter_timer_config(IPA_INTER_TIMER_ENABLE);

  //开启传输
  ipa_transfer_enable();

  //等待传输结束
  while(RESET == ipa_interrupt_flag_get(IPA_INT_FLAG_FTF));

  //清除标志位
  ipa_interrupt_flag_clear(IPA_INT_FLAG_FTF);

  //关闭IPA
  ipa_deinit();

  //填回像素点
  LCDDrawPoint(x1, y1, color1);
  LCDDrawPoint(x2, y2, color2);
}

/*********************************************************************************************************
* 函数名称：LCDFillPixel
* 函数功能：LCD填充
* 输入参数：x0, y0：起始坐标，x1, y1：终点坐标，color：填充颜色
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
void LCDFillPixel(u32 x0, u32 y0, u32 x1, u32 y1, u32 color)
{
  u32 swap, width, height;

  //校验横坐标
  if(x0 > x1)
  {
    swap = x0;
    x0 = x1;
    x1 = swap;
  }

  //校验纵坐标
  if(y0 > y1)
  {
    swap = y0;
    y0 = y1;
    y1 = swap;
  }

  //计算宽度
  width = x1 - x0 + 1;

  //计算高度
  height = y1 - y0 + 1;

  //填充
  LCDFill(x0, y0, width, height, color);
}

