HomiKetalys/gd32ai-modelzoo/object_detection/yolo_fastestv2/deployment/GD32H759I_EVAL_GCC/App/TLILCD/TLILCD.c
/*********************************************************************************************************
* 函数名称：LCDColorFill
* 函数功能：LCD填充
* 输入参数：x, y：起始坐标，width：宽度，height：高度，color：填充颜色缓冲区首地址
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
void LCDColorFill(u32 x, u32 y, u32 width, u32 height, u16* color)
{
  u32 x0, y0, i;

  //保存起始坐标
  x0 = x;
  y0 = y;

  //填充
  i = 0;
  for(y = y0; y < y0 + height; y++)
  {
    for(x = x0; x < x0 + width; x++)
    {
      LCDDrawPoint(x, y, color[i]);
      i++;
    }
  }
}

/*********************************************************************************************************
* 函数名称：LCDFillPixel
* 函数功能：LCD填充
* 输入参数：x0, y0：起始坐标，x1, y1：终点坐标，color：填充颜色缓冲区首地址
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
void LCDColorFillPixel(u32 x0, u32 y0, u32 x1, u32 y1, u16* color)
{
  u32 x, y, swap, i;

  //校验横坐标
  if(x0 > x1)
  {
    swap = x0;
    x0 = x1;
    x1 = swap;
  }

  //校验纵坐标
  if(y0 > y1)
  {
    swap = y0;
    y0 = y1;
    y1 = swap;
  }

  //填充
  i = 0;
  for(y = y0; y <= y1; y++)
  {
    for(x = x0; x <= x1; x++)
    {
      LCDDrawPoint(x, y, color[i]);
      i++;
    }
  }
}

/*********************************************************************************************************
* 函数名称：LCDDrawLine
* 函数功能：画线
* 输入参数：x0，y0：起点坐标，x1，y1：终点坐标，color：颜色
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
void LCDDrawLine(u32 x0, u32 y0, u32 x1, u32 y1, u32 color)
{
  int x, y, dx, dy, dx2, dy2, xStep, yStep, swap, sum;

  //计算x、y方向增量
  dx = x1 - x0;
  dy = y1 - y0;
  if(dx < 0){dx = -dx;}
  if(dy < 0){dy = -dy;}
  dx2 = dx << 1;
  dy2 = dy << 1;

  //斜率小于等于1，以横坐标增长方向计算
  if(dx >= dy)
  {
    //修正绘制方向（按增长方向绘制）
    if(x0 > x1)
    {
      swap = x0; x0 = x1; x1 = swap;
      swap = y0; y0 = y1; y1 = swap;
    }

    //判断y增长方向
    if(y1 > y0){yStep = 1;}else{yStep = -1;}

    x = x0;
    y = y0;
    sum = -dx;
    while(x <= x1)
    {
      //画点
      LCDDrawPoint(x, y, color);

      //横坐标自增
      x = x + 1;

      //纵坐标判别式
      sum = sum + dy2;

      //纵坐标自增
      if(sum >= 0)
      {
        sum = sum - dx2;
        y = y + yStep;
      }
    }
  }

  //斜率大于1，以纵坐标增长方向计算
  else
  {
    //修正绘制方向（按增长方向绘制）
    if(y0 > y1)
    {
      swap = x0; x0 = x1; x1 = swap;
      swap = y0; y0 = y1; y1 = swap;
    }

    //判断x增长方向
    if(x1 > x0){xStep = 1;}else{xStep = -1;}

    x = x0;
    y = y0;
    sum = -dy;
    while(y <= y1)
    {
      //画点
      LCDDrawPoint(x, y, color);

      //纵坐标自增
      y = y + 1;

      //横坐标判别式
      sum = sum + dx2;

      //横坐标自增
      if(sum >= 0)
      {
        sum = sum - dy2;
        x = x + xStep;
      }
    }
  }
}

/*********************************************************************************************************
* 函数名称：LCDDrawRectangle
* 函数功能：画矩形
* 输入参数：(x1,y1),(x2,y2):矩形的对角坐标，color：颜色
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
void LCDDrawRectangle(u32 x1, u32 y1, u32 x2, u32 y2, u32 color)
{
  LCDDrawLine(x1, y1, x2, y1, color);
  LCDDrawLine(x1, y1, x1, y2, color);
  LCDDrawLine(x1, y2, x2, y2, color);
  LCDDrawLine(x2, y1, x2, y2, color);
}

/*********************************************************************************************************
* 函数名称：LCDDrawCircle
* 函数功能：画圆
* 输入参数：x0，y0：圆心坐标，r：半径，color：颜色
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
void LCDDrawCircle(u32 x0, u32 y0, u32 r, u32 color)
{
  int x, y, d;

  x = 0;
  y = r;
  d = 5 - (r << 2);
  while(x <= y)
  {
    //根据圆的八分对称性画点
    LCDDrawPoint(x0 + x, y0 + y, color);
    LCDDrawPoint(x0 + x, y0 - y, color);
    LCDDrawPoint(x0 - x, y0 + y, color);
    LCDDrawPoint(x0 - x, y0 - y, color);
    LCDDrawPoint(x0 + y, y0 + x, color);
    LCDDrawPoint(x0 - y, y0 + x, color);
    LCDDrawPoint(x0 + y, y0 - x, color);
    LCDDrawPoint(x0 - y, y0 - x, color);

    //横坐标自增
    x++;

    //取右侧点
    if(d < 0)
    {
      d = d + (x << 3) + 12;
    }

    //取对角点
    else
    {
      d = d + ((x - y) << 3) + 20;
      y--;
    }
  }
}

/*********************************************************************************************************
* 函数名称：LCDShowChar
* 函数功能：在指定位置显示一个字符
* 输入参数：x,y：显示坐标
*          font：字体，LCD_FONT_12、LCD_FONT_16或LCD_FONT_24
*          mode：显示模式，透明或非透明，LCD_TEXT_NORMAL或LCD_TEXT_TRANS
*          textColor：字符颜色
*          backColor：背景颜色
*          code：字符编码，英文对应ASCII码，汉字对应GBK汉字内码
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：1. 扫描顺序是高位在前，从上到下，从左往右，一列最后不满一个字节的则补零
						2. 显示中文字符时只能使用LCD_FONT_24
*********************************************************************************************************/
void LCDShowChar(u32 x, u32 y, EnumTLILCDFont font, EnumTLILCDTextMode mode, u32 textColor, u32 backColor, u32 code)
{
  u8  byte;      //当前点阵数据
  u32 i, j;      //循环变量
  u32 y0;        //纵坐标起点
  u32 height;    //字符高度
  u32 bufSize;   //点阵数据字节数
  u8* enBuf;     //ASCII码点阵数据首地址
  //static u8  cnBuf[72]; //汉字点阵数据缓冲区
  u8* codeBuf;   //字符点阵数据首地址，二选一

  //获取字符高度
  switch (font)
  {
  case LCD_FONT_12: height = 12; break;
  case LCD_FONT_16: height = 16; break;
  case LCD_FONT_24: height = 24; break;
  default: return;
  }

  //计算点阵数据字节数
  if(code < 0x80) //ASCII码
  {
    switch (font)
    {
    case LCD_FONT_12: bufSize = 12; break;
    case LCD_FONT_16: bufSize = 16; break;
    case LCD_FONT_24: bufSize = 36; break;
    default: return;
    }
  }
  else //中文
  {
    switch (font)
    {
    case LCD_FONT_24: bufSize = 72; break;
    default: return;
    }
  }

  //获取点阵数据
  if(code < 0x80) //ASCII码
  {
    switch (font)
    {
    case LCD_FONT_12: enBuf = (u8*)asc2_1206[code - ' ']; break;
    case LCD_FONT_16: enBuf = (u8*)asc2_1608[code - ' ']; break;
    case LCD_FONT_24: enBuf = (u8*)asc2_2412[code - ' ']; break;
    default: return;
    }
    codeBuf = enBuf;
  }
  else //中文
  {
		return;
//    if(LCD_FONT_24 == font)
//    {
//      GetCNFont24x24(code, cnBuf);
//    }
//    else
//    {
//      for(i = 0; i < bufSize; i++)
//      {
//        cnBuf[i] = 0xFF;
//      }
//    }
//    codeBuf = cnBuf;
  }

  //记录纵坐标起点
  y0 = y;

