HomiKetalys/gd32ai-modelzoo/object_detection/yolo_fastestv2/deployment/GD32H759I_EVAL_GCC/App/TLILCD/TLILCD.c
  //按照高位在前，从上到下，从左往右扫描顺序显示
  for(i = 0; i < bufSize; i++)
  {
    //获取点阵数据
    byte = codeBuf[i];

    for(j = 0; j < 8; j++)
    {
      if(byte & 0x80)
      {
        LCDDrawPoint(x, y, textColor);
      }
      else if(LCD_TEXT_NORMAL == mode)
      {
        LCDDrawPoint(x, y, backColor);
      }

      byte <<= 1;
      y++;

      //超区域了
      if(y >= g_structTLILCDDev.height[g_structTLILCDDev.currentLayer])
      {
        return;
      }

      if((y - y0) >= height)
      {
        y = y0;
        x++;

        //超区域了
        if(x >= g_structTLILCDDev.width[g_structTLILCDDev.currentLayer])
        {
          return;
        }

        //字节切到下一个字节
        break;
      }
    }
  }
}
/*********************************************************************************************************
* 函数名称：LCDShowString
* 函数功能：显示字符串
* 输入参数：x,y：显示坐标
*          width：显示区域宽度
*          height：显示区域高度
*          font：字体，LCD_FONT_12、LCD_FONT_16或LCD_FONT_24
*          mode：显示模式，透明或非透明，LCD_TEXT_NORMAL或LCD_TEXT_TRANS
*          textColor：字符颜色
*          backColor：背景颜色
*          string：字符串首地址
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
void LCDShowString(u32 x, u32 y, u32 width, u32 height, EnumTLILCDFont font, EnumTLILCDTextMode mode, u32 textColor, u32 backColor, char* string)
{
  u32 x0, x1, y1, cWidth, i, code;
  
  //记录起始坐标
  x0 = x;

  //计算终点坐标
  x1 = x0 + width - 1;
  y1 = x1 + height - 1;

  //计算字符宽度，中文宽度是ASCII码的两倍
  switch (font)
  {
  case LCD_FONT_12: cWidth = 6; break;
  case LCD_FONT_16: cWidth = 8; break;
  case LCD_FONT_24: cWidth = 12; break;
  default: return;
  }

  //循环显示所有字符
  i = 0;
  while(0 != string[i])
  {
    if((u8)string[i] < 0x80) //ASCII码
    {
      //显示当前字符
      LCDShowChar(x, y, font, mode, textColor, backColor, string[i]);

      //更新x、y坐标
      if((x + cWidth) > x1)
      {
        x = x0;
        y = y + height;

        //纵坐标也超出范围，则写入结束
        if(y > y1)
        {
          return;
        }
      }
      else
      {
        x = x + cWidth;
      }

      //切换到下一个字符
      i = i + 1;
    }
    else
    {
      //获取汉字内码
      code = (string[i] << 8) | string[i + 1];

      //显示当前字符
      LCDShowChar(x, y, font, mode, textColor, backColor, code);

      //更新x、y坐标
      if((x + cWidth * 2) > x1)
      {
        x = x0;
        y = y + height;

        //纵坐标也超出范围，则写入结束
        if(y > y1)
        {
          return;
        }
      }
      else
      {
        x = x + cWidth * 2;
      }

      //切换到下一个字符
      i = i + 2;
    }
  }
}

/*********************************************************************************************************
* 函数名称：LCDWindowSave
* 函数功能：保存内指定区域图像
* 输入参数：x,y：起始坐标，width：宽度，height：高度，saveBuf：图像保存地址
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：因为保存方向是横屏，所以竖屏时必须与LCDWindowFill搭配使用
*********************************************************************************************************/
void LCDWindowSave(u32 x, u32 y, u32 width, u32 height, void* saveBuf)
{
  ipa_foreground_parameter_struct  ipa_fg_init_struct;          //前景图像参数结构体
  ipa_destination_parameter_struct ipa_destination_init_struct; //目标图像参数结构体
  u32 foreStartAddr;       //前景图像起始地址
  u32 phyWidth, phyHeight; //横屏宽度和高度
  u32 phyX, phyY;          //横屏时填充起始地址
  u32 lineOff;             //目标行偏移，最后一个像素和下一行第一个像素之间的像素数目
  u32 swap;                //交换数据时的临时变量

  //横屏，记录宽度、高低以及起始地址
  if(LCD_SCREEN_HORIZONTAL == g_structTLILCDDev.dir)
  {
    phyWidth = g_structTLILCDDev.width[g_structTLILCDDev.currentLayer];
    phyHeight = g_structTLILCDDev.height[g_structTLILCDDev.currentLayer];
    phyX = x;
    phyY = y;
  }

  //竖屏，因为是按照横屏方式配置，所以要将宽度、高度转换过来，并做起始坐标转换
  else if(LCD_SCREEN_VERTICAL == g_structTLILCDDev.dir)
  {
    //获取屏幕宽度和高度
    phyWidth = g_structTLILCDDev.width[g_structTLILCDDev.currentLayer];
    phyHeight = g_structTLILCDDev.height[g_structTLILCDDev.currentLayer];

    //交换屏幕宽度和高度
    swap = phyWidth;
    phyWidth = phyHeight;
    phyHeight = swap;

    //交换填充区域宽度和高度
    swap = width;
    width = height;
    height = swap;

    //坐标系转换
    phyX = phyWidth - y - width;
    phyY = x;
  }

  //窗口区域大小修正，防止窗口区域超出屏幕范围
  if((phyX + width) > LCD_PIXEL_WIDTH)
  {
    width = LCD_PIXEL_WIDTH - phyX;
  }
  if((phyY + height) > LCD_PIXEL_HEIGHT)
  {
    height = LCD_PIXEL_HEIGHT - phyY;
  }

  //计算前景图像起始地址
  foreStartAddr = (u32)g_structTLILCDDev.frameBuf + g_structTLILCDDev.pixelSize * (phyWidth * phyY + phyX);

  //计算前景行偏移
  lineOff = phyWidth - width;

  //使能IPA时钟
  rcu_periph_clock_enable(RCU_IPA);

  //复位IPA
  ipa_deinit();

  //设置转换模式
  ipa_pixel_format_convert_mode_set(IPA_FGTODE); //复制某一源图像到目标图像中

  //设置前景图像参数
  ipa_foreground_struct_para_init(&ipa_fg_init_struct);
  ipa_fg_init_struct.foreground_pf              = FOREGROUND_PPF_RGB565; //前景层像素格式
  ipa_fg_init_struct.foreground_memaddr         = foreStartAddr;         //前景层存储区基地址
  ipa_fg_init_struct.foreground_lineoff         = lineOff;               //前景层行偏移
  ipa_fg_init_struct.foreground_alpha_algorithm = IPA_FG_ALPHA_MODE_0;   //前景层alpha值计算算法，无影响
  ipa_fg_init_struct.foreground_prealpha        = 0xFF; //前景层预定义透明度
  ipa_fg_init_struct.foreground_prered          = 0x00; //前景层预定义红色值
  ipa_fg_init_struct.foreground_pregreen        = 0x00; //前景层预定义绿色值
  ipa_fg_init_struct.foreground_preblue         = 0x00; //前景层预定义蓝色值
  ipa_foreground_init(&ipa_fg_init_struct);             //根据参数配置前景图像

  //设置目标图像参数
  ipa_destination_struct_para_init(&ipa_destination_init_struct);
  ipa_destination_init_struct.destination_pf       = IPA_DPF_RGB565; //目标图像格式
  ipa_destination_init_struct.destination_memaddr  = (u32)saveBuf;   //目标图像存储地址
  ipa_destination_init_struct.destination_lineoff  = 0;              //行末与下一行开始之间的像素点数
  ipa_destination_init_struct.destination_prealpha = 0xFF;           //目标层预定义透明度
  ipa_destination_init_struct.destination_prered   = 0x00;           //目标层预定义红色值
  ipa_destination_init_struct.destination_pregreen = 0x00;           //目标层预定义绿色值
  ipa_destination_init_struct.destination_preblue  = 0x00;           //目标层预定义蓝色值
  ipa_destination_init_struct.image_width          = width;          //目标图像宽度
  ipa_destination_init_struct.image_height         = height;         //目标图像高度
  ipa_destination_init(&ipa_destination_init_struct);                //根据参数配置目标图像

  // //使能IPA内部定时器
  // ipa_interval_clock_num_config(0);
  // ipa_inter_timer_config(IPA_INTER_TIMER_ENABLE);

  //开启传输
  ipa_transfer_enable();

  //等待传输结束
  while(RESET == ipa_interrupt_flag_get(IPA_INT_FLAG_FTF));

