HomiKetalys/gd32ai-modelzoo/object_detection/yolo_fastestv2/deployment/GD32H759I_EVAL_GCC/App/TLILCD/TLILCD.c
  //清除标志位
  ipa_interrupt_flag_clear(IPA_INT_FLAG_FTF);

  //关闭IPA
  ipa_deinit();
}

/*********************************************************************************************************
* 函数名称：LCDWindowFill
* 函数功能：在内指定区域内绘制图像
* 输入参数：x,y：起始坐标，width：宽度，height：高度，imageBuf：图像所在地址
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：因为保存方向是横屏，所以竖屏时必须与LCDWindowSave搭配使用
*********************************************************************************************************/
void LCDWindowFill(u32 x, u32 y, u32 width, u32 height, void* imageBuf)
{
  ipa_foreground_parameter_struct  ipa_fg_init_struct;          //前景图像参数结构体
  ipa_destination_parameter_struct ipa_destination_init_struct; //目标图像参数结构体
  u32 destStartAddr;       //目标图像起始地址
  u32 phyWidth, phyHeight; //横屏宽度和高度
  u32 phyX, phyY;          //横屏时填充起始地址
  u32 lineOff;             //目标行偏移，最后一个像素和下一行第一个像素之间的像素数目
  u32 swap;                //交换数据时的临时变量

  //横屏，记录宽度、高低以及起始地址
  if(LCD_SCREEN_HORIZONTAL == g_structTLILCDDev.dir)
  {
    phyWidth = g_structTLILCDDev.width[g_structTLILCDDev.currentLayer];
    phyHeight = g_structTLILCDDev.height[g_structTLILCDDev.currentLayer];
    phyX = x;
    phyY = y;
  }

  //竖屏，因为是按照横屏方式配置，所以要将宽度、高度转换过来，并做起始坐标转换
  else if(LCD_SCREEN_VERTICAL == g_structTLILCDDev.dir)
  {
    //获取屏幕宽度和高度
    phyWidth = g_structTLILCDDev.width[g_structTLILCDDev.currentLayer];
    phyHeight = g_structTLILCDDev.height[g_structTLILCDDev.currentLayer];

    //交换屏幕宽度和高度
    swap = phyWidth;
    phyWidth = phyHeight;
    phyHeight = swap;

    //交换填充区域宽度和高度
    swap = width;
    width = height;
    height = swap;

    //坐标系转换
    phyX = phyWidth - y - width;
    phyY = x;
  }

  //窗口区域大小修正，防止窗口区域超出屏幕范围
  if((phyX + width) > LCD_PIXEL_WIDTH)
  {
    width = LCD_PIXEL_WIDTH - phyX;
  }
  if((phyY + height) > LCD_PIXEL_HEIGHT)
  {
    height = LCD_PIXEL_HEIGHT - phyY;
  }

  //计算目标图像起始地址
  destStartAddr = (u32)g_structTLILCDDev.frameBuf + g_structTLILCDDev.pixelSize * (phyWidth * phyY + phyX);

  //计算目标行偏移
  lineOff = phyWidth - width;

  //使能IPA时钟
  rcu_periph_clock_enable(RCU_IPA);

  //复位IPA
  ipa_deinit();

  //设置转换模式
  ipa_pixel_format_convert_mode_set(IPA_FGTODE); //复制某一源图像到目标图像中

  //设置前景图像参数
  ipa_foreground_struct_para_init(&ipa_fg_init_struct);
  ipa_fg_init_struct.foreground_pf              = FOREGROUND_PPF_RGB565; //前景层像素格式
  ipa_fg_init_struct.foreground_memaddr         = (u32)imageBuf;         //前景层存储区基地址
  ipa_fg_init_struct.foreground_lineoff         = 0;                     //前景层行偏移
  ipa_fg_init_struct.foreground_alpha_algorithm = IPA_FG_ALPHA_MODE_0;   //前景层alpha值计算算法，无影响
  ipa_fg_init_struct.foreground_prealpha        = 0xFF; //前景层预定义透明度
  ipa_fg_init_struct.foreground_prered          = 0x00; //前景层预定义红色值
  ipa_fg_init_struct.foreground_pregreen        = 0x00; //前景层预定义绿色值
  ipa_fg_init_struct.foreground_preblue         = 0x00; //前景层预定义蓝色值
  ipa_foreground_init(&ipa_fg_init_struct);             //根据参数配置前景图像

  //设置目标图像参数
  ipa_destination_struct_para_init(&ipa_destination_init_struct);
  ipa_destination_init_struct.destination_pf       = IPA_DPF_RGB565;     //目标图像格式
  ipa_destination_init_struct.destination_memaddr  = (u32)destStartAddr; //目标图像存储地址
  ipa_destination_init_struct.destination_lineoff  = lineOff; //行末与下一行开始之间的像素点数
  ipa_destination_init_struct.destination_prealpha = 0xFF;    //目标层预定义透明度
  ipa_destination_init_struct.destination_prered   = 0x00;    //目标层预定义红色值
  ipa_destination_init_struct.destination_pregreen = 0x00;    //目标层预定义绿色值
  ipa_destination_init_struct.destination_preblue  = 0x00;    //目标层预定义蓝色值
  ipa_destination_init_struct.image_width          = width;   //目标图像宽度
  ipa_destination_init_struct.image_height         = height;  //目标图像高度
  ipa_destination_init(&ipa_destination_init_struct);         //根据参数配置目标图像

  // //使能IPA内部定时器
  // ipa_interval_clock_num_config(0);
  // ipa_inter_timer_config(IPA_INTER_TIMER_ENABLE);

  //开启传输
  ipa_transfer_enable();

  //等待传输结束
  while(RESET == ipa_interrupt_flag_get(IPA_INT_FLAG_FTF));

  //清除标志位
  ipa_interrupt_flag_clear(IPA_INT_FLAG_FTF);

  //关闭IPA
  ipa_deinit();
}

/*********************************************************************************************************
* 函数名称：RGB565ToRGB888A
* 函数功能：RGB565转RGB888
* 输入参数：rgb656：RGB565值
*          r、g、b：转换结果
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
void RGB565ToRGB888A(u16 rgb565, u8* r, u8* g, u8* b)
{
  *r = ((0xF800 & rgb565) >> 11) & 0xFF;
  *g = ((0x07E0 & rgb565) >> 5 ) & 0xFF;
  *b = ((0x001F & rgb565) << 0 ) & 0xFF;
}

/*********************************************************************************************************
* 函数名称：RGB565ToRGB888B
* 函数功能：RGB565转RGB888
* 输入参数：rgb656：RGB565值
* 输出参数：void
* 返 回 值：转换结果
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
u32 RGB565ToRGB888B(u16 rgb565)
{
  u8 r, g, b;
  r = ((0xF800 & rgb565) >> 11) & 0xFF;
  g = ((0x07E0 & rgb565) >> 5 ) & 0xFF;
  b = ((0x001F & rgb565) >> 0 ) & 0xFF;
  return ((r << 16) | (g << 8) | (b << 0));
}

/*********************************************************************************************************
* 函数名称：RGB888ToRGB565A
* 函数功能：RGB888转RGB565
* 输入参数：r、g、b：RGB888
* 输出参数：void
* 返 回 值：转换结果
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
u32 RGB888ToRGB565A(u8 r, u8 g, u8 b)
{
  r = r >> 3;
  g = g >> 2;
  b = b >> 3;

  return ((r << 11) | (g << 5) | (b << 0));
}

/*********************************************************************************************************
* 函数名称：RGB888ToRGB565A
* 函数功能：RGB888转RGB565
* 输入参数：r、g、b：RGB888
* 输出参数：void
* 返 回 值：转换结果
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
u32 RGB888ToRGB565B(u32 rgb888)
{
  u8 r, g, b;

  r = (rgb888 >> 16) & 0xFF;
  g = (rgb888 >> 8 ) & 0xFF;
  b = (rgb888 >> 0 ) & 0xFF;

  return RGB888ToRGB565A(r, g, b);
}
